app/controllers/locations_controller.rb

	def create
		@location = Location.new(location_params)
		if @location.save
---
INSERT INTO "locations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 27 Jan 2014 11:21:56 UTC +00:00], ["updated_at", Mon, 27 Jan 2014 11:21:56 UTC +00:00]]

	def show
		begin
			@location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]

	def destroy
		Location.destroy(params[:id])
---
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]